---
kind: other
id: Properties.T:Autodesk.Revit.DB.CancellationListener
source: html/b9f74cb7-454f-445e-e443-57d20f9f34ff.htm
---
# CancellationListener Properties

Specifies whether the .NET object represents a valid Revit entity.